Revit 2027 API
FamilyInstance.GetFamilyPointPlacementReferences Method
Returns the Point Placement References for the Family Instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FamilyPointPlacementReference> GetFamilyPointPlacementReferences()
Public Function GetFamilyPointPlacementReferences As IList(Of FamilyPointPlacementReference)
public:
IList<FamilyPointPlacementReference^>^ GetFamilyPointPlacementReferences()
member GetFamilyPointPlacementReferences : unit -> IList<FamilyPointPlacementReference>
Return Value
IList<FamilyPointPlacementReference>
Remarks
If a family instance has point placement references then they are returned by this method, otherwise an empty collection is returned. Examples of FamilyInstance objects that contain placement references are Panels and Flexible Components.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace